
# 数组：
intArr = [1, 4, 2, 5, 3, 7, 9, 0]  # 整型数组
strArr = ["北京", "上海", "杭州", "深圳"]  # 字符串数组
mixArr = [1, 3.44, "hello", [1, 2, 3]]  # 混合数组
emptyArr = []  # 空数组

# 现在这些数组都是list类型
# [1, 4, 2, 5, 3, 7, 9, 0]
# ['北京', '上海', '杭州', '深圳']
# [1, 3.44, 'hello', [1, 2, 3]]
# []

########################################################
# 获取数组长度
########################################################
int_length = len(intArr)
print(int_length)

########################################################
# 在数组中添加元素
########################################################
strArr.append("广东")  # 向数组末尾添加一个元素
intArr.extend([11, 45, 13])  # 向数组末尾添加多个元素（添加一个数组 ）
mixArr.insert(0, "我是榜首")  # 向指定位置向数组中添加一个元素

# [1, 4, 2, 5, 3, 7, 9, 0, 11, 45, 13]
# ['北京', '上海', '杭州', '深圳', '广东']
# ['我是榜首', 1, 3.44, 'hello', [1, 2, 3]]
# []

########################################################
# 从数组获取元素
########################################################
str = strArr[0]  # 获取元素
print(str)
strArr[0] = "BeiJing"  # 为元素赋值

# 北京
# [1, 4, 2, 5, 3, 7, 9, 0, 11, 45, 13]
# ['BeiJing', '上海', '杭州', '深圳', '广东']
# ['我是榜首', 1, 3.44, 'hello', [1, 2, 3]]
# []


###############################################
# 删除元素
###############################################
strArr.remove("杭州")  # 删除数组中的元素
del strArr[0]  # 删除数组中的元素
# del strArr  # 删除这个数组中所有的元素
city = strArr.pop(2)  # 删除数组中的元素，并且返回被删除的元素
print("被删除的元素是：%s" %city)

# 北京
# 被删除的元素是：广东
# [1, 4, 2, 5, 3, 7, 9, 0, 11, 45, 13]
# ['上海', '深圳']
# ['我是榜首', 1, 3.44, 'hello', [1, 2, 3]]
# []

####################################################
# 通过元素确定信息：
###################################################
# 1 判断数组中是否存在某给元素

print("判断某个元素是否在数组中")
result = "上海" in strArr
print(result)
result = "ShangHai" not in strArr
print(result)
# True
# True

# 2 获取数组中的指定元素的个数
strArr.append("上海")
strArr.append("上海")
result = strArr.count("上海");
print("字符串数组中上海的个数是%s" %result)

# 字符串数组中上海的个数是3
# [1, 4, 2, 5, 3, 7, 9, 0, 11, 45, 13]
# ['上海', '深圳', '上海', '上海']
# ['我是榜首', 1, 3.44, 'hello', [1, 2, 3]]
# []

# 3 获取索引，即指定元素在数组中的位置，位置从0开始
result = strArr.index("深圳")
print("字符串数组中深圳的位置是%s" %result)
# 字符串数组中深圳的位置是1

######################################################
# 排序，翻转，最大最小值
######################################################
intArr.sort()  # 正序排序
print(intArr)
# intArr.sort(reverse=True) #逆序排序

# [0, 1, 2, 3, 4, 5, 7, 9, 11, 13, 45]

intArr.reverse()  # 数组反转
print(intArr)

# [45, 13, 11, 9, 7, 5, 4, 3, 2, 1, 0]

temp = [1, 2, 3, 4, 5]
result = max(temp)
print("数组中最大值是：“”", result)
# 数组中最大值是：5

result = min(temp)
print("数组中最小值是：%s" %result)
# 数组中最小值是：1


temp = [1, 2, 3, 4, 5]
result = sum(temp)
print("数组中元素的总和是：%s" %result)
# 数组中元素的总和是：15

print(intArr)
print(strArr)
print(mixArr)
print(emptyArr)
