# -*- coding:utf-8 -*-

import numpy as np
import pandas as pd

#####################################
#  创建6*4矩阵数据
#####################################

dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.arange(24).reshape(6, 4), index=dates, columns=['a', 'b', 'c', 'd'])
print(df)

####################################
# 简单的筛选
####################################
# 选择a列的数据
print(df['a'])
print(df.a)

# 选择跨行或多列
print(df[0:3])
print(df['20130102':'20130104'])

########################
# 根据标签筛选
########################

# 根据loc标签进行选择
print(df.loc['20130102'])
print(df.loc[:, ['a', 'b']])

# 根据序列iloc  按index检索
print(df.iloc[3, 1])    # 第四行第二个
print(df.iloc[3:5, 1:3])
print(df.iloc[[1, 3, 5], 1:3])

#########################
# 3.混合两种ix
#########################
print(df.ix[:3, ['a', 'c']])

#########################
# 4.通过判断筛选b
#########################
print(df[df.a > 8])    # a列里大于8的部分


