# -*- coding:utf-8 -*-


import numpy as np
#######################
# 一维索引
#######################

# 一维矩阵情况：
a = np.arange(3, 15)    # array([3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14])
print(a[3])     # 6

# 二维矩阵情况：
a.reshape((3, 4))
print(a[2])     # 5
# 虽然是二维数组，但是还是可以进行一维索引，这种情况下把二维数组
# 依次排开再进行一维索引

#######################
# 二维索引
#######################
a = np.arange(3, 15).reshape((3, 4))
print(a[1][1])      # 8
print(a[1, 1])       # 8
# 这两种方法输出的结果相同
print(a[1, 1:3])    # [8, 9] 可以通过list进行切片操作

# falt是一个将二维数组展开成一维数组的函数
print(a.flatten())      # array([3, 4, 5, 6, 7, 8, 9,  10, 11, 12, 13, 14])
for item in a.flat:
    print(item)


